// Components/FAQ/FAQ.jsx
import { useState } from "react";
import "./FAQ.scss";

export const FAQ = () => {
  const [openIndex, setOpenIndex] = useState<number | null>(null);

  const questions = [
    {
      q: "Чи безпечно бути вдома під час хімчистки?",
      a: "Так, це абсолютно безпечно. Наші засоби не мають стороннього запаху, не токсичні та не шкодять здоровʼю. Ви можете залишатися вдома під час хімчистки, але рекомендуємо провітрювати приміщення після завершення процесу для кращого результату.",
    },
    {
      q: "Як часто потрібно робити хімчистку меблів?",
      a: "Рекомендовано робити хімчистку раз на 6-12 місяців. Якщо ви маєте алергію, астму чи інші захворювання дихальних шляхів, то частіше, за потребою. Також якщо меблі активно експлуатуються, або складаються з тендітних матеріалів, також варто робити хімчистку частіше.",
    },
    {
      q: "Що робити з тваринами в квартирі, коли прийдуть майстри?",
      a: "Єдине, що може заважати - це гучний звук від роботи обладнання. В іншому, наші засоби - безпечні, не мають стороннього запаху та не шкодять будь-кому, хто знаходиться у приміщенні під час хімчистки.",
    },
    {
      q: "Чи надаємо ми гарантію результату?",
      a: "Ми маємо широкий спектр різноманітних ефективних засобів та технологій чистки, які індивідуально підбираються під кожну пляму. Але, на жаль, час, ультрофіолет, спроби самостійної чистки плям, можуть дуже повпливати на результат, тому майстер у процесі завжди консультує щодо можливого результату у вашому конкретному випадку.",
    },
    {
      q: "Чи довго меблі сохнуть після хімчистки?",
      a: "Ящо це не вплине на результат чистки та не зашкодіть матеріалу, меблі можна залишити сохнути самостійно. Завичай самостіне висихання триває 6-12 годин, у рідких випадках до 24 годин. Але ми надаємо послугу примусової сушки. Після неї, ви зможете користуватись меблям практично відразу.",
    },
    {
      q: "Чому моїм меблям потрібна хімчистка?",
      a: "Очевидно, якщо на меблях багато плям та забруднень, хімчистка дозволяє повернути їм гарний вигляд. Крім цього, мʼякі меблі, як і інші меблі, збирають у собі чимало пилу, а у поєднанні з теплом і вологістю - це чудове середовище для розмноження пильвоих кліщів. Хімчистка дохволяє очстити меблі від цих шкідників, алергенів тощо",
    },
  ];

  const toggleQuestion = (index: number) => {
    setOpenIndex(openIndex === index ? null : index);
  };

  return (
    <section className="faq">
      <div className="faq__container">
        {/* Ліва частина */}
        <div className="faq__left">
          <h2>Питання</h2>
          <p>
            Тут ви знайдете відповіді на найпопулярніші запитання про наші
            послуги, умови та процес роботи.
          </p>
        </div>

        {/* Права частина */}
        <div className="faq__right">
          {questions.map((item, index) => (
            <div
              key={index}
              className={`faq__item ${
                openIndex === index ? "faq__item--open" : ""
              }`}
            >
              <div
                className="faq__question"
                onClick={() => toggleQuestion(index)}
              >
                <span>{item.q}</span>
                <button>{openIndex === index ? "−" : "+"}</button>
              </div>
              {openIndex === index && <p className="faq__answer">{item.a}</p>}
            </div>
          ))}
        </div>
      </div>
    </section>
  );
};
